src/Reports/OtherComprehensiveIncome.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Report>
		<Properties>
			<Name>OtherComprehensiveIncome</Name>
		</Properties>
	</Report>
</MetaDataObject>

src/Enums/AccountTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Enum>
		<Properties>
			<Name>AccountTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>AccountsPayable</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AccountsReceivable</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AccumulatedDepreciation</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Bank</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CostOfSales</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Equity</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Expense</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FixedAsset</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Income</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Inventory</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>LongTermLiability</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OtherCurrentAsset</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OtherCurrentLiability</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OtherExpense</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OtherIncome</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OtherNonCurrentAsset</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Companies.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Catalog>
		<Properties>
			<Name>Companies</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>USTaxID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SalesTaxCode</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.SalesTaxCodes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DefaultCurrency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Vendor1099</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FirstName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MiddleName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LastName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Phone</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Country</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Countries</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>State</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.States</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Customer</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Vendor</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AddressLine1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AddressLine2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>City</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ZIP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Name</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExpenseAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IncomeAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VATNumber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Bank</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Banks</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Website</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Notes</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/ChartsOfAccounts/ChartOfAccounts.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<ChartOfAccounts>
		<Properties>
			<Name>ChartOfAccounts</Name>
			<ExtDimensionTypes>ChartOfCharacteristicTypes.Dimensions</ExtDimensionTypes>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>AccountType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.AccountTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Category1099</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.USTaxCategories1099</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OtherComprehensiveIncome</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IncomeTaxAccount</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CashFlowSection</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CashFlowSections</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfAccounts>
</MetaDataObject>

src/Reports/OtherComprehensiveIncome/Ext/ObjectModule.bsl
Function OtherComprehensiveIncome(StartDate, EndDate) Export
	
	StartD = StartDate;
	EndD = EndDate;
	
	If StartDate =  Date(1,1,1) Then
		WhereCase = "AND GeneralJournalTurnovers.Period <= &EndDate";
		PeriodLabel = "- " + Format(EndD, "DLF=D");
	EndIf;
	
	If EndDate =  Date(1,1,1) Then
		WhereCase = "AND GeneralJournalTurnovers.Period >= &StartDate";
		PeriodLabel = Format(StartD, "DLF=D") + " -";
	EndIf;
	
	If StartDate = Date(1,1,1) AND EndDate = Date(1,1,1) Then
		WhereCase = "";
		PeriodLabel = "All dates";
	EndIf;
	
	If NOT StartDate = Date(1,1,1) AND NOT EndDate = Date(1,1,1) Then
		WhereCase = "AND GeneralJournalTurnovers.Period >= &StartDate AND GeneralJournalTurnovers.Period <= &EndDate";
		PeriodLabel = Format(StartD, "DLF=D") + " - " + Format(EndD, "DLF=D");
	EndIf;
	
	OurCompany = Catalogs.Companies.OurCompany;
	
	SpreadsheetDocument = New SpreadsheetDocument;
	Template = GetTemplate("Template");
	
	Header = Template.GetArea("Header");
	Header.Parameters.PeriodLabel = PeriodLabel;
	Header.Parameters.Company = GeneralFunctions.GetAttributeValue(OurCompany, "Name");
	SpreadsheetDocument.Put(Header);
	
	// Main section
	
	Query = New Query("SELECT
	                  |	GeneralJournalTurnovers.Account,
	                  |	SUM(GeneralJournalTurnovers.AmountRCTurnover) AS AmountTurnover,
	                  |	ChartOfAccounts.Description,
	                  |	ChartOfAccounts.AccountType
	                  |FROM
	                  |	AccountingRegister.GeneralJournal.Turnovers(, , Day, , ) AS GeneralJournalTurnovers
	                  |		LEFT JOIN ChartOfAccounts.ChartOfAccounts AS ChartOfAccounts
	                  |		ON GeneralJournalTurnovers.Account = ChartOfAccounts.Ref
	                  |WHERE
					  | ChartOfAccounts.OtherComprehensiveIncome = TRUE
	                  |	" + WhereCase + "
	                  |
	                  |GROUP BY
	                  |	GeneralJournalTurnovers.Account,
	                  |	ChartOfAccounts.Description,
	                  |	ChartOfAccounts.AccountType");
	Query.Parameters.Insert("StartDate", StartDate);
	Query.Parameters.Insert("EndDate", EndDate);
	Selection = Query.Execute().Choose();
	
	MainSection = Template.GetArea("MainSection");
	
	TotalIncome = 0;
	
	While Selection.Next() Do
		
		MainSection.Parameters.Description = Selection.Description;
		
		If Selection.AccountType = Enums.AccountTypes.AccountsReceivable OR
		Selection.AccountType = Enums.AccountTypes.AccumulatedDepreciation OR
	    Selection.AccountType = Enums.AccountTypes.Bank OR
		Selection.AccountType = Enums.AccountTypes.CostOfSales OR
		Selection.AccountType = Enums.AccountTypes.Expense OR
		Selection.AccountType = Enums.AccountTypes.FixedAsset OR
		Selection.AccountType = Enums.AccountTypes.Inventory OR
		Selection.AccountType = Enums.AccountTypes.OtherCurrentAsset OR
		Selection.AccountType = Enums.AccountTypes.OtherExpense OR
		Selection.AccountType = Enums.AccountTypes.OtherNonCurrentAsset Then				
			IncomeAmount = Selection.AmountTurnover;
		Else
			IncomeAmount = Selection.AmountTurnover * -1;
		EndIf;

		
		MainSection.Parameters.AmountTurnover = IncomeAmount;
		SpreadsheetDocument.Put(MainSection);
		TotalIncome = TotalIncome + IncomeAmount;
		
	EndDo;

	MainSectionFooter = Template.GetArea("MainSectionFooter");
	MainSectionFooter.Parameters.TotalIncome = TotalIncome;
	SpreadsheetDocument.Put(MainSectionFooter);
	
	// Return result
	
	Return SpreadSheetDocument;
	
EndFunction
